NETMF/netmf-interpreter/DeviceCode/Targets/Native/STM32F4/DeviceCode/STM32F4_ETH_lwip_OS/STM32F4_ETH_driver.cpp
    // Wait for PHY availability
    while ( ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) &&
            (nWait < MII_BUSY_TIMEOUT) )
    {
        nWait++;
    }
    if (nWait == MII_BUSY_TIMEOUT)
    {
        return FALSE;
    }
    
    // Write PHY address
    ETH->MACMIIAR &= ~ETH_MACMIIAR_PA;
    ETH->MACMIIAR |= ((PHY_ADDRESS << MACMIIAR_PA_POSITION) & ETH_MACMIIAR_PA);
    
    // Write PHY register
    ETH->MACMIIAR &= ~ETH_MACMIIAR_MR;
    ETH->MACMIIAR |= ((miiAddress << MACMIIAR_MR_POSITION) & ETH_MACMIIAR_MR);
    
    // Clear MII write
    ETH->MACMIIAR &= ~ETH_MACMIIAR_MW;
    
    // Set MII busy
    ETH->MACMIIAR |= ETH_MACMIIAR_MB;
    
    // Wait for completion
    nWait = 0U;
    while ( ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) &&
            (nWait < MII_BUSY_TIMEOUT) )
    {
        nWait++;
    }

    if (nWait == MII_BUSY_TIMEOUT)
    {
        return FALSE;
    }

    // Read data
    *pMiiData = ETH->MACMIIDR;
    
    return TRUE;
}

//--------------------------------------------------------------------------------------------
/**
 * Write to a PHY register through MII.
 * @param miiAddress the address of the register to write.
 * @param miiData the value to write.
 * @return Error status.
 *   @retval TRUE if write successful.
 *   @retval FALSE otherwise.
 */
static BOOL writePhyRegister(const uint32_t miiAddress, const uint16_t miiData)
{
    volatile uint32_t nWait = 0U; 
    
    // Wait for PHY availability
    while ( ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) &&
            (nWait < MII_BUSY_TIMEOUT) )
    {
        nWait++;
    }
    if (nWait == MII_BUSY_TIMEOUT)
    {
        return FALSE;
    }
    
    // Write PHY address
    ETH->MACMIIAR &= ~ETH_MACMIIAR_PA;
    ETH->MACMIIAR |= ((PHY_ADDRESS << MACMIIAR_PA_POSITION) & ETH_MACMIIAR_PA);
    
    // Write MII register
    ETH->MACMIIAR &= ~ETH_MACMIIAR_MR;
    ETH->MACMIIAR |= ((miiAddress << MACMIIAR_MR_POSITION) & ETH_MACMIIAR_MR);
    
    // Set MII write
    ETH->MACMIIAR |= ETH_MACMIIAR_MW;
    
    // Write MII data
    ETH->MACMIIDR = miiData;
    
    // Set MII busy
    ETH->MACMIIAR |= ETH_MACMIIAR_MB;
    
    // Wait for completion
    nWait = 0U;
    while ( ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) &&
            (nWait < MII_BUSY_TIMEOUT) )
    {
        nWait++;
    }
    if (nWait == MII_BUSY_TIMEOUT)
    {
        return FALSE;
    }
    return TRUE;
}

//--------------------------------------------------------------------------------------------
